app/views/welcome/index.html.erb

        <% for i in 0..(@entries.length-1) %>
          <li><%= link_to @entries[i][:text].truncate(65, :separator => ' '), url_for([@user, @entries[i]]) %></li>
---
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 6]]