app/controllers/entries_controller.rb

INSERT INTO "entities" ("count", "created_at", "e_type", "entry_id", "sentiment_score", "sentiment_type", "string_representation", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "entries" ("created_at", "hour_created", "humidity", "lat", "long", "most_common_adjective", "most_common_adverb", "subject", "temperature", "tense_orientation", "text", "updated_at", "user_id", "user_mood_input", "word_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    alchemy_api = Alchemy.new()
    @entry = Entry.new(params[:entry])
    @entry_entities = alchemy_api.entities('text', @entry.text, { sentiment: 1 })["entities"]
    @entry.user_id = current_user.id
    @entry.word_count = params[:entry][:text].split(' ').length


    if @entry.save

SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT 1  [["id", "5"]]
UPDATE "entries" SET "text" = 'I need to see some entities get created in my entities db table. Therefore, I am including the wonderful Aaron Rodgers in this entry. He is a both a fantastic football player and a loving husband. Long live the good fellow!', "user_mood_input" = 7, "updated_at" = '2013-12-15 04:40:45.352880' WHERE "entries"."id" = 10
SELECT "entities".* FROM "entities" WHERE "entities"."entry_id" = 10
DELETE FROM "entities" WHERE "entities"."id" = $1  [["id", 2]]
INSERT INTO "entities" ("count", "created_at", "e_type", "entry_id", "sentiment_score", "sentiment_type", "string_representation", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def update
    alchemy_api = Alchemy.new()
    @entry = Entry.find(params[:id])
    if @entry.update_attributes(params[:entry])
      # destroy all entities associated with entry,
      # as entities may be entirely differnent in the updated text
      @entry.entities.each do |entity|
        entity.destroy
      end
      # make new call to API with updated text, returns array of entities
      @entry_entities = alchemy_api.entities('text', @entry.text, { sentiment: 1 })["entities"]
      # TODO are word counts updated? I'm too tired to figure out where to persist this data
      @entry.word_count = @entry.text.split(' ').length

      # abstraction test
      @entry.create_entities(@entry_entities)

SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 1]]
---
  def destroy
    # binding.pry
    @entry = Entry.find(params[:id])
    if @entry.destroy