app/controllers/welcome_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1 ORDER BY id DESC LIMIT 5
SELECT COUNT(*) FROM "entries" WHERE "entries"."user_id" = 1
---
  def index
    @entries = user_signed_in? && current_user.entries.size > 0 ? Entry.where(user_id: current_user.id).last(5).reverse : []